bot_name = 'Помощник при расчете еды 🍔🍩🎂'
bot_description = ''
bot_help_message = 'Приветики, Пупсик 😘😘😘\n\nЯ твой бот-помощник по расчету еды 🍔🍩🎂'

# Commands
command_start_description = 'Начать пользоваться ботом ▶️'
command_calc_ingredients_mass = 'Расчет части еды для Пупсика 🍔'

# Buttons
calc_food_button_title = 'Начать расчет'

# Errors handling
error_float_convert = 'Не могу понять введенное число 😔\nПопробуй ввести еще раз 😊'

# Other
implement_me = 'Напиши реализацию'
access_denied = 'Ты не Пупсик, тебе нельзя пользоваться этим ботом!'
i_am_sweeties = 'я пупсик'

# IngredientsMassCalculator
iwc_enter_your_food_mass = 'Пупсик, введи массу своей доли, приготовленной еды 🍕'
iwc_enter_rest_food_mass = 'Пупсик, введи массу оставшейся части, приготовленной еды 🥦'
iwc_enter_ingredients = 'Пупсик, введи ингредиенты и их массу 🥕🧀🧄\n\n*Пример:*\n\nкурица 90\nсыр 30\nсметана 20'
iwc_error_parse_ingredients = 'Не смог понять твой список 😔, попробуй еще раз, смотри пример ☝'
iwc_client_part = 'Твоя часть: {client_part:.1f}%\n\n'
iwc_warn_ingredients_mass = ('❗️Масса всех ингредиентов *{ingredients_mass}г* превышает массу приготовленной еды '
                             'на *{diff_mass}г*\n\n')
iwc_good_bye = '\nВсе готово, Пупсик 😘😘😘'
